#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//for循环练习：计算1-100之间3的倍数的求和
//int main()
//{
//	int n = 0;
//	int sum = 0;
//	for (n = 1; n <= 100;n++)//问题拆分：1.产生1-100的数字  2.判断是否3的倍数  3.如果是就求和  sum+=n(同样置于循环内  最后打印输出）
//	{
//		if (n % 3 == 0)
//			sum = sum + n;
//	}
//	printf("%d\n", sum);
//	return 0;
//}
//化简   认为简化问题路径 来减少计算机操作 从而提高效率（思考问题的方法）
//int main()
//{
//	int n = 0;
//	int sum = 0;
//	for (n = 3; n <= 100; n+=3)//问题拆分：1.产生1-100的数字  2.判断是否3的倍数  3.如果是就求和  sum+=n(同样置于循环内  最后打印输出）
//	{
//			sum = sum + n;
//	}
//	printf("%d\n", sum);
//	return 0;
//}



//do while 循环练习
//输入一个整数判断几位数
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int sum = 1;
//	//for循环
//	for (n; n / 10 != 0;n/=10)
//	{
//		sum++;
//	}
//	printf("%d", sum);
//	return 0;
//}
//while循环
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int sum = 0;
//	while(n)//巧用0的非真性  为0则出
//	{
//		sum++;
//		n /= 10;
//	}
//	printf("%d", sum);
//	return 0;
//}//但0结果为0
//do while 循环
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int sum = 0;
//	do//先执行
//	{
//		sum++;
//		n /= 10;
//	} while (n);
//	printf("%d", sum);
//	return 0;
//}
// 
// 
// 
//*****三种循环：
//while循环:循环书写较方便，但当执行语句过多时，循环部分过于分散
//while(判断结束标志)
//{
//执行语句
//}
//for循环：使用最多，较为紧凑，最便捷  循环顺序234    
// 特别注意：for循环三个124部分均可省略  但当判断部分省略时，判断恒为真，陷入死循环
//for(初始化语句1;判断结束语句2；调整语句4）
//{
// 执行语句3；
//}
//do while循环：至少执行一次，先do 
// do
// {
// 执行语句；
// }while(判断结束语句）；
// 
// 
// break:终止整体循环
// continue:终止本次循环中continue后的执行程序，并重新开始下一次循环
// 一般与if连用（但一定要注意判断所写代码程序的初始值，关键值，结束值，可能会有坑，或者是按照程序一步一步走）
// continue位置放置不当容易导致死循环（后方的跳出循环代码始终被continue跳过，无法执行）
// 
// 
// 
// 
// 
//